In [2]:
load_ext sql

In [3]:
%sql mysql+pymysql://root:easwari@localhost

keywords -->  select, from, where,and, or, like, not like, between , not between, 
distinct, >, < is null, is not null, order by asc, order by desc

---> select

In [4]:
%%sql
show databases;

 * mysql+pymysql://root:***@localhost
16 rows affected.

[('employees',),
 ('events',),
 ('functions',),
 ('information_schema',),
 ('joins',),
 ('joins interview',),
 ('mysql',),
 ('performance_schema',),
 ('sales',),
 ('set operations',),
 ('students',),
 ('subqueries',),
 ('sys',),
 ('triggers',),
 ('window functions interview questuions',),
 ('window_functions',)]

In [6]:
%%sql
use `window_functions`;

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

In [9]:
%%sql
SHOW tables;

 * mysql+pymysql://root:***@localhost
20 rows affected.

[('amazon_adobe',),
 ('electronics_sales',),
 ('employees',),
 ('employees2',),
 ('items',),
 ('netflix_dataset',),
 ('netflix_review',),
 ('npv',),
 ('orders',),
 ('orders2',),
 ('payments',),
 ('product_name',),
 ('product_price',),
 ('productdelivery',),
 ('products',),
 ('products2',),
 ('queries',),
 ('rides',),
 ('students',),
 ('trip',)]

In [10]:
%%sql
SELECT * FROM employees;

 * mysql+pymysql://root:***@localhost
10 rows affected.

[(1, 'Lavanya', 'HR', 50000),
 (2, 'Jaanu', 'Finance', 60000),
 (3, 'Lakshith', 'HR', 45000),
 (4, 'Darshith', 'Finance', 55000),
 (5, 'Priya', 'IT', 70000),
 (6, 'Keerthana', 'IT', 72000),
 (7, 'Janani', 'HR', 47000),
 (8, 'Rohitha', 'Finance', 64000),
 (9, 'Varsha', 'IT', 69000),
 (10, 'Kavya', 'IT', 72000)]

In [11]:
%%sql
SELECT name,salary 
FROM employees;

 * mysql+pymysql://root:***@localhost
10 rows affected.

[('Lavanya', 50000),
 ('Jaanu', 60000),
 ('Lakshith', 45000),
 ('Darshith', 55000),
 ('Priya', 70000),
 ('Keerthana', 72000),
 ('Janani', 47000),
 ('Rohitha', 64000),
 ('Varsha', 69000),
 ('Kavya', 72000)]

In [14]:
%%sql
select name,salary
from employees
where salary > 70000;

 * mysql+pymysql://root:***@localhost
2 rows affected.

[('Keerthana', 72000), ('Kavya', 72000)]

In [15]:
%%sql
select name,salary
from employees
where salary < 70000;

 * mysql+pymysql://root:***@localhost
7 rows affected.

[('Lavanya', 50000),
 ('Jaanu', 60000),
 ('Lakshith', 45000),
 ('Darshith', 55000),
 ('Janani', 47000),
 ('Rohitha', 64000),
 ('Varsha', 69000)]

In [16]:
%%sql
select name,salary
from employees
where salary = 70000;

 * mysql+pymysql://root:***@localhost
1 rows affected.

[('Priya', 70000)]

In [17]:
%%sql
select name,salary
from employees
where salary != 70000;

 * mysql+pymysql://root:***@localhost
9 rows affected.

[('Lavanya', 50000),
 ('Jaanu', 60000),
 ('Lakshith', 45000),
 ('Darshith', 55000),
 ('Keerthana', 72000),
 ('Janani', 47000),
 ('Rohitha', 64000),
 ('Varsha', 69000),
 ('Kavya', 72000)]

In [19]:
%%sql
select name,salary
from employees
where salary in(70000,60000,47000);

 * mysql+pymysql://root:***@localhost
3 rows affected.

[('Jaanu', 60000), ('Priya', 70000), ('Janani', 47000)]

In [20]:
%%sql
select name,salary
from employees
where salary not in(70000,60000,47000);

 * mysql+pymysql://root:***@localhost
7 rows affected.

[('Lavanya', 50000),
 ('Lakshith', 45000),
 ('Darshith', 55000),
 ('Keerthana', 72000),
 ('Rohitha', 64000),
 ('Varsha', 69000),
 ('Kavya', 72000)]

In [23]:
%%sql
select name,salary
from employees
where name like('L%');

 * mysql+pymysql://root:***@localhost
2 rows affected.

[('Lavanya', 50000), ('Lakshith', 45000)]

In [25]:
%%sql
select name,salary
from employees
where name like('%a');

 * mysql+pymysql://root:***@localhost
6 rows affected.

[('Lavanya', 50000),
 ('Priya', 70000),
 ('Keerthana', 72000),
 ('Rohitha', 64000),
 ('Varsha', 69000),
 ('Kavya', 72000)]

In [26]:
%%sql
select name,salary
from employees
where name like('%roh%');

 * mysql+pymysql://root:***@localhost
1 rows affected.

[('Rohitha', 64000)]

sum(), count(), min(), max(), avg()

In [29]:
%%sql
select salary 
from employees;

 * mysql+pymysql://root:***@localhost
10 rows affected.

[(50000,),
 (60000,),
 (45000,),
 (55000,),
 (70000,),
 (72000,),
 (47000,),
 (64000,),
 (69000,),
 (72000,)]

In [30]:
%%sql
select sum(salary)
from employees;

 * mysql+pymysql://root:***@localhost
1 rows affected.

[(Decimal('604000'),)]

In [31]:
%%sql
select * from employees;

 * mysql+pymysql://root:***@localhost
10 rows affected.

[(1, 'Lavanya', 'HR', 50000),
 (2, 'Jaanu', 'Finance', 60000),
 (3, 'Lakshith', 'HR', 45000),
 (4, 'Darshith', 'Finance', 55000),
 (5, 'Priya', 'IT', 70000),
 (6, 'Keerthana', 'IT', 72000),
 (7, 'Janani', 'HR', 47000),
 (8, 'Rohitha', 'Finance', 64000),
 (9, 'Varsha', 'IT', 69000),
 (10, 'Kavya', 'IT', 72000)]

In [32]:
%%sql
select department,salary
from employees;

 * mysql+pymysql://root:***@localhost
10 rows affected.

[('HR', 50000),
 ('Finance', 60000),
 ('HR', 45000),
 ('Finance', 55000),
 ('IT', 70000),
 ('IT', 72000),
 ('HR', 47000),
 ('Finance', 64000),
 ('IT', 69000),
 ('IT', 72000)]

In [35]:
%%sql
select department,sum(salary) as `total_salary`
from employees
group by department;

 * mysql+pymysql://root:***@localhost
3 rows affected.

[('HR', Decimal('142000')),
 ('Finance', Decimal('179000')),
 ('IT', Decimal('283000'))]

In [38]:
%%sql
select department,sum(salary) as `total_salary`
from employees
group by department
having total_salary > 179000;

 * mysql+pymysql://root:***@localhost
1 rows affected.

[('IT', Decimal('283000'))]

In [40]:
%%sql
select *
from employees
where department in('HR','IT');

 * mysql+pymysql://root:***@localhost
7 rows affected.

[(1, 'Lavanya', 'HR', 50000),
 (3, 'Lakshith', 'HR', 45000),
 (5, 'Priya', 'IT', 70000),
 (6, 'Keerthana', 'IT', 72000),
 (7, 'Janani', 'HR', 47000),
 (9, 'Varsha', 'IT', 69000),
 (10, 'Kavya', 'IT', 72000)]

In [42]:
%%sql
select department, sum(salary) as `total_salary`
from employees
where department in('HR','IT')
group by department;

 * mysql+pymysql://root:***@localhost
2 rows affected.

[('HR', Decimal('142000')), ('IT', Decimal('283000'))]

In [43]:
%%sql
select department, sum(salary) as `total_salary`
from employees
where department in('HR','IT')
group by department
having `total_salary`>150000;

 * mysql+pymysql://root:***@localhost
1 rows affected.

[('IT', Decimal('283000'))]